[
  {
    "bank_id": "RY",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q1",
    "call_date": "2024-02-28",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Dave McKay, President and CEO of Royal Bank of Canada. We're pleased to report first quarter results that demonstrate the strength of our diversified business model.\n\nNet income for the quarter was $4.0B, up 4% from last year, with diluted EPS of $2.85. We're building momentum across our businesses.\n\nOur Canadian Banking segment delivered solid results with revenue growth of 6% with We continue to see good demand for mortgages and our digital adoption rates exceeded 85%.. We continue to see solid demand across our product lines and our digital adoption rates continue to climb.\n\nWealth Management had a good quarter with steady growth with assets under administration reaching $1267B. Our high-net-worth business continues to gain share as clients value our comprehensive advisory capabilities and global platform.\n\nCapital Markets delivered exceptional results with revenues up 25%. Our global markets franchise benefited from increased client activity and favorable market conditions and we continue to build our sustainable finance capabilities.\n\nCredit quality remains strong with PCL ratio of 24 bps. We continue to maintain robust allowances and our diversified portfolio limits concentration risk.\n\nOur CET1 ratio of 12.7% provides substantial flexibility for growth and capital return. We're well positioned for growth and capital return.\n\nLooking ahead, we're confident in our trajectory and well positioned to navigate the evolving economic environment.\n\nI'll now turn it over to Katherine Gibson, our CFO, to provide more details on our financial performance.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Ebrahim Poonawala with Bank of America.\n\nEbrahim Poonawala: Good morning. Dave McKay, can you talk about the outlook for Canadian mortgage growth given the rate environment?\n\nDave McKay: We're seeing steady demand in the mortgage market. As rates potentially decline, we expect to see some pickup in activity. Our focus remains on quality originations.\n\nEbrahim Poonawala: And on credit in the consumer portfolio?\n\nGraeme Hepworth: Overall credit performance remains solid. Delinquencies remain well within historical ranges.\n\nOperator: Our next question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning. Can you discuss the sustainability of the capital markets performance?\n\nDave McKay: While we benefited from favorable conditions, our capital markets franchise has been consistently gaining share. We've invested in talent and technology.\n\nPaul Holden: And on expenses, how should we think about the efficiency ratio?\n\nKatherine Gibson: We delivered positive operating leverage this quarter. Our technology investments are driving automation savings.\n\nOperator: Our next question comes from Mario Mendonca with TD Securities.\n\nMario Mendonca: On wealth management, can you talk about the competitive environment?\n\nDave McKay: Talent is always competitive. We've been successful in recruiting through our industry-leading platform and training programs.\n\nOperator: That concludes our Q&A session. Thank you for participating in today's call."
    }
  },
  {
    "bank_id": "TD",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q1",
    "call_date": "2024-02-28",
    "sections": {
      "management_discussion": "Good morning and thank you for joining us. I'm Bharat Masrani, Group President and CEO of TD Bank Group.\n\nWe reported first quarter earnings of $3.1B on an adjusted basis, demonstrating the resilience of our franchise.. Diluted EPS was $1.71 on an adjusted basis.\n\nWe continue to make progress strengthening our risk and control environment in our US operations. We've enhanced our AML compliance program and added experienced leadership.\n\nOur Canadian Personal and Commercial Bank delivered solid results with revenue growth of 4%. We continue to benefit from our leading deposit franchise, with market share above 22%. Net interest margin was stable as the benefits of higher rates offset competitive pressures.\n\nIn US Retail, we saw revenue growth of 2% on a constant currency basis. Our deposit franchise remained strong with market share stable.\n\nWealth Management and Insurance had a good quarter with AUM reaching $520 billion. Our direct investing platform continues to gain clients and we're seeing strong engagement with our digital tools.\n\nWholesale Banking delivered improved results with trading revenues up. Our corporate lending book remains well-positioned with a focus on investment-grade clients.\n\nOur CET1 ratio increased to 12.1% this quarter. This provides flexibility for growth once we complete our remediation work.\n\nCredit quality remained stable with PCL of 52 bps. We're maintaining prudent reserves given economic uncertainty.\n\nLooking ahead, our priority remains executing on our strategic initiatives and strengthening our US franchise.\n\nI'll now turn the call over to Kelvin Tran, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Nigel D'Souza with Veritas Investment Research.\n\nNigel D'Souza: Good morning. Bharat Masrani, can you provide an update on the timeline for completing the AML remediation?\n\nBharat Masrani: We're making substantial progress. We've added over 1,500 people focused on compliance and are upgrading systems. This is a multi-year journey and we're committed to getting it right.\n\nNigel D'Souza: And how should we think about growth in US Retail once remediation is complete?\n\nBharat Masrani: We remain committed to the US market. Once we're through this period, we'll look at opportunities to grow. Near-term focus is on execution.\n\nOperator: Our next question comes from Doug Young with Desjardins.\n\nDoug Young: Good morning. Can you talk about net interest margin outlook given potential rate cuts?\n\nKelvin Tran: We're well positioned for various rate scenarios. We've been extending duration on the securities portfolio. We expect NIM to remain relatively stable.\n\nDoug Young: And on expenses - what's driving the increase?\n\nKelvin Tran: Expense growth reflects our investments in risk and control infrastructure. We expect growth to moderate as we achieve efficiencies.\n\nOperator: Our next question comes from Meny Grauman with Scotiabank.\n\nMeny Grauman: Can you discuss the outlook for the Schwab stake?\n\nBharat Masrani: We plan to manage our position over time in an orderly manner. The timing will depend on market conditions.\n\nOperator: That concludes our Q&A session. Thank you for participating."
    }
  },
  {
    "bank_id": "BMO",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q1",
    "call_date": "2024-02-28",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Darryl White, CEO of BMO Financial Group.\n\nWe delivered first quarter with adjusted net income of $1.9B and EPS of $2.54. These results demonstrate the earnings power of our diversified North American franchise.\n\nWe continue to make progress on the Bank of the West integration with synergies tracking ahead of plan.\n\nCanadian Personal and Commercial Banking delivered revenue growth of 5% with solid loan growth. Our market share in business banking remained strong.\n\nUS Personal and Commercial Banking saw continued momentum with revenue growth of 12%. Client retention has exceeded expectations and we're winning new relationships.\n\nBMO Capital Markets had an excellent quarter with revenue up 20%. Our North American platform is winning share with corporate clients and we're building our presence in sustainable finance.\n\nBMO Wealth Management grew earnings by 12% with assets under management reaching record levels. Our private banking business continues to attract high-net-worth clients in both Canada and the US.\n\nCredit quality remained stable with PCL of 52 bps. We're maintaining strong allowances and our diversified portfolio limits concentration risk.\n\nOur CET1 ratio of 13.0% is at the top of our target range, providing flexibility for organic growth. Operating leverage was 5.0% this quarter.\n\nLooking ahead, we're focused on realizing the full potential of our North American franchise.\n\nI'll now turn it over to Tayfun Tuzun, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from John Aiken with Barclays.\n\nJohn Aiken: Good morning. Darryl White, now that integration is progressing, how should we think about growth opportunities in the US?\n\nDarryl White: We're excited about our US positioning. The focus near-term is on driving revenue synergies - cross-selling and bringing our full product suite to customers.\n\nJohn Aiken: And can you quantify the revenue synergy opportunity?\n\nDarryl White: We're making good progress on our synergy targets. Mortgage referrals and treasury management cross-sell are up significantly.\n\nOperator: Our next question comes from Ebrahim Poonawala with Bank of America.\n\nEbrahim Poonawala: Good morning. Can you talk about the commercial real estate portfolio?\n\nPiyush Agrawal: Our CRE portfolio is well-diversified. Office represents less than 10% and is primarily in Canada with strong tenants. We're comfortable with our reserves.\n\nEbrahim Poonawala: And on capital, with CET1 strong, is there room for additional buybacks?\n\nTayfun Tuzun: We have capacity for buybacks and evaluate it regularly. We want to maintain flexibility while also returning capital to shareholders.\n\nOperator: Our next question comes from Gabriel Dechaine with National Bank Financial.\n\nGabriel Dechaine: Darryl White, how are you thinking about the competitive environment in California?\n\nDarryl White: California is a dynamic market with strong demographics. We have advantages - our commercial expertise and now meaningful scale. Client feedback has been positive.\n\nOperator: That concludes our Q&A session. Thank you for joining us today."
    }
  },
  {
    "bank_id": "BNS",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q1",
    "call_date": "2024-02-28",
    "sections": {
      "management_discussion": "Good morning and thank you for joining us. I'm Scott Thomson, President and CEO of Scotiabank.\n\nWe reported first quarter net income of $1.8B with diluted EPS of $1.38. While these results reflect ongoing headwinds in some international markets, we're making progress on our strategic repositioning.\n\nWe continue to execute on our strategy of focusing resources on our core markets of Canada, Mexico, and select international operations.\n\nCanadian Banking delivered solid results with revenue growth of 3%. We continue to invest in digital capabilities.\n\nInternational Banking showed resilience despite challenging conditions. Mexico remains our priority international market with significant opportunity.\n\nGlobal Wealth Management had a good quarter with AUM growth. Our Canadian wealth business is gaining share and our digital investing platforms are seeing strong engagement.\n\nGlobal Banking and Markets delivered improved results. Our focus on deepening client relationships is paying off.\n\nCredit quality normalized with PCL of 50 bps. Latin American provisions remain elevated but in line with expectations.\n\nOur CET1 ratio of 12.1% provides adequate flexibility.\n\nI'm confident we're building a more focused and profitable bank.\n\nI'll now turn it over to Raj Viswanathan, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Doug Young with Desjardins.\n\nDoug Young: Good morning Scott Thomson. Can you provide more details on the timeline for exiting certain Latin American markets?\n\nScott Thomson: We're making good progress on announced transactions. We expect to close the majority by mid-year with some extending into the second half.\n\nDoug Young: And how should we think about reinvesting that capital?\n\nScott Thomson: Our priority is strengthening the balance sheet and investing in core markets. Canada and Mexico offer attractive opportunities.\n\nOperator: Our next question comes from Meny Grauman with Scotiabank.\n\nMeny Grauman: Good morning. Can you discuss credit trends in your Canadian retail portfolio?\n\nPhil Thomas: Canadian retail credit remains in good shape. Delinquencies have normalized but are within historical ranges.\n\nMeny Grauman: And on Mexico credit outlook?\n\nPhil Thomas: Mexico PCLs are running higher than Canada but in line with expectations. Our through-the-cycle provisioning means we're comfortable with reserves.\n\nOperator: Our next question comes from Scott Chan with Canaccord Genuity.\n\nScott Chan: Scott Thomson, your efficiency ratio remains above peers - what's the path to closing that gap?\n\nScott Thomson: Improving efficiency is a key priority. The international rationalization will help. We're also investing in automation and digitization.\n\nOperator: That concludes our Q&A session. Thank you for participating."
    }
  },
  {
    "bank_id": "CM",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q1",
    "call_date": "2024-02-28",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Victor Dodig, President and CEO of CIBC.\n\nWe delivered first quarter results with net income of $1.6B and diluted EPS of $1.67. Our focused strategy on being a relationship-oriented bank continues to drive growth.\n\nCIBC's Canadian focus remains a source of strength.\n\nCanadian Personal and Business Banking grew revenue by 4% with balanced growth across products. Our mortgage portfolio grew 3%, maintaining our strong market position.\n\nCanadian Commercial Banking and Wealth Management had an excellent quarter. Commercial loan growth of 6% reflected strong demand from mid-market clients.\n\nUS Commercial Banking and Wealth Management delivered stable results. Our focused US franchise serving clients with Canadian connections continues to perform well.\n\nCapital Markets performed well with revenue up 15%. Our client-focused approach continues to differentiate us in Canadian capital markets.\n\nCredit quality was solid with PCL of 32 bps. Our conservative underwriting approach has resulted in a high-quality loan portfolio.\n\nOur CET1 ratio of 13.0% is among the highest in our peer group, providing substantial flexibility. We continue to invest in technology and our digital capabilities.\n\nLooking ahead, we're confident in our strategy and well positioned for continued success.\n\nI'll now turn it over to Hratch Panossian, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Darko Mihelic with RBC Capital Markets.\n\nDarko Mihelic: Good morning Victor Dodig. Your mortgage book continues to outperform - what's driving that?\n\nVictor Dodig: A few factors. Conservative underwriting, concentration in urban markets with stronger fundamentals, and our portfolio mix skews toward lower LTV borrowers.\n\nDarko Mihelic: And on market share in a potentially busier refinancing market?\n\nVictor Dodig: We're well positioned for increased activity. Our branch network and mobile origination tools are excellent.\n\nOperator: Our next question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning. Can you discuss the outlook for capital markets?\n\nVictor Dodig: Our capital markets business is designed to be less volatile given our client focus. We're gaining share in advisory and our trading desk has invested in capabilities.\n\nPaul Holden: And on expenses, how should we think about the trajectory?\n\nHratch Panossian: We're committed to positive operating leverage. We continue to invest in technology while achieving efficiencies in other areas.\n\nOperator: Our next question comes from Scott Chan with Canaccord Genuity.\n\nScott Chan: Victor Dodig, do you see any M&A opportunities that make sense for CIBC?\n\nVictor Dodig: We're very focused on organic growth. We don't feel we need M&A to compete effectively. We'd look at opportunities that strengthen our Canadian franchise.\n\nOperator: That concludes our Q&A session. Thank you for joining us today."
    }
  },
  {
    "bank_id": "NA",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q1",
    "call_date": "2024-02-28",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Laurent Ferreira, President and CEO of National Bank of Canada.\n\nWe delivered first quarter with net income of $854M, up 6% from last year, and diluted EPS of $2.44. These results continue our track record of outperformance.\n\nNational Bank has consistently delivered superior returns among Canadian banks. Our ROE of 16.4% this quarter remains industry-leading.\n\nPersonal and Commercial Banking in Quebec delivered excellent results with revenue growth of 6%. Our market position in Quebec remains exceptionally strong.\n\nWealth Management had an outstanding quarter with earnings up 18%. Our full-service brokerage platform continues to attract advisors and clients.\n\nFinancial Markets delivered strong results with revenue up 20%. Our trading and fixed income businesses performed well.\n\nUS Specialty Finance and International continues to grow profitably.\n\nOur expansion outside Quebec remains a strategic priority. We're building our commercial banking presence in key markets.\n\nCredit quality was excellent with PCL of 20 bps. Our conservative Quebec-focused portfolio continues to deliver below-peer credit costs.\n\nOur CET1 ratio of 12.6% provides substantial flexibility.\n\nI'm proud of what our team continues to achieve. Our focused strategy positions us well for continued outperformance.\n\nI'll now turn it over to Marie Chantal Gingras, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Lemar Persaud with Cormark Securities.\n\nLemar Persaud: Good morning Laurent Ferreira. Can you provide an update on the Canadian Western Bank acquisition?\n\nLaurent Ferreira: We're excited about this transaction. Regulatory approvals are progressing. CWB adds scale in Western Canada and diversifies our geographic exposure.\n\nLemar Persaud: What are the synergy expectations?\n\nLaurent Ferreira: We've identified meaningful cost synergies primarily in corporate functions and technology. Revenue synergies from product cross-sell are also mapped out.\n\nOperator: Our next question comes from Mario Mendonca with TD Securities.\n\nMario Mendonca: Good morning. Your ROE continues to lead the industry - what's sustainable going forward?\n\nLaurent Ferreira: Our ROE reflects our leading Quebec position, efficient operations, and disciplined capital allocation. We see no reason that should change.\n\nMario Mendonca: And on your geographic expansion, how do you compete outside Quebec?\n\nLaurent Ferreira: We're selective. We focus on commercial banking where relationships matter. We've had success winning clients who appreciate our service model.\n\nOperator: Our next question comes from Ebrahim Poonawala with Bank of America.\n\nEbrahim Poonawala: Laurent Ferreira, can you discuss the competitive environment in Quebec?\n\nLaurent Ferreira: Quebec remains our fortress. We have relationships going back generations. Competitors have tried to gain share with limited success.\n\nOperator: That concludes our Q&A session. Thank you for participating in today's call."
    }
  },
  {
    "bank_id": "RY",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q2",
    "call_date": "2024-05-23",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Dave McKay, President and CEO of Royal Bank of Canada. We're pleased to report second quarter results that demonstrate the strength of our diversified business model.\n\nNet income for the quarter was $4.2B, up 7% from last year, with diluted EPS of $3.02. We're building momentum across our businesses.\n\nOur Canadian Banking segment delivered solid results with revenue growth of 6% with We continue to see good demand for mortgages and our digital adoption rates exceeded 85%.. We continue to see solid demand across our product lines and our digital adoption rates continue to climb.\n\nWealth Management had a good quarter with steady growth with assets under administration reaching $1338B. Our high-net-worth business continues to gain share as clients value our comprehensive advisory capabilities and global platform.\n\nCapital Markets performed well despite market volatility. Our global markets franchise benefited from increased client activity and favorable market conditions and we continue to build our sustainable finance capabilities.\n\nCredit quality remains strong with PCL ratio of 24 bps. We continue to maintain robust allowances and our diversified portfolio limits concentration risk.\n\nOur CET1 ratio of 13.0% provides substantial flexibility for growth and capital return. We're well positioned for growth and capital return.\n\nLooking ahead, we're confident in our trajectory and well positioned to navigate the evolving economic environment.\n\nI'll now turn it over to Katherine Gibson, our CFO, to provide more details on our financial performance.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Darko Mihelic with RBC Capital Markets.\n\nDarko Mihelic: Good morning. Dave McKay, can you talk about the outlook for Canadian mortgage growth given the rate environment?\n\nDave McKay: We're seeing steady demand in the mortgage market. As rates potentially decline, we expect to see some pickup in activity. Our focus remains on quality originations.\n\nDarko Mihelic: And on credit in the consumer portfolio?\n\nGraeme Hepworth: Overall credit performance remains solid. Delinquencies remain well within historical ranges.\n\nOperator: Our next question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning. Can you discuss the sustainability of the capital markets performance?\n\nDave McKay: While we benefited from favorable conditions, our capital markets franchise has been consistently gaining share. We've invested in talent and technology.\n\nPaul Holden: And on expenses, how should we think about the efficiency ratio?\n\nKatherine Gibson: We delivered positive operating leverage this quarter. Our technology investments are driving automation savings.\n\nOperator: Our next question comes from Nigel D'Souza with Veritas Investment Research.\n\nNigel D'Souza: On wealth management, can you talk about the competitive environment?\n\nDave McKay: Talent is always competitive. We've been successful in recruiting through our industry-leading platform and training programs.\n\nOperator: That concludes our Q&A session. Thank you for participating in today's call."
    }
  },
  {
    "bank_id": "TD",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q2",
    "call_date": "2024-05-23",
    "sections": {
      "management_discussion": "Good morning and thank you for joining us. I'm Bharat Masrani, Group President and CEO of TD Bank Group.\n\nWe reported second quarter earnings of $3.2B on an adjusted basis, demonstrating the resilience of our franchise.. Diluted EPS was $1.77 on an adjusted basis.\n\nWe continue to make progress strengthening our risk and control environment in our US operations. We've enhanced our AML compliance program and added experienced leadership.\n\nOur Canadian Personal and Commercial Bank delivered solid results with revenue growth of 4%. We continue to benefit from our leading deposit franchise, with market share above 22%. Net interest margin was stable as the benefits of higher rates offset competitive pressures.\n\nIn US Retail, we saw revenue growth of 2% on a constant currency basis. Our deposit franchise remained strong with market share stable.\n\nWealth Management and Insurance had a good quarter with AUM reaching $520 billion. Our direct investing platform continues to gain clients and we're seeing strong engagement with our digital tools.\n\nWholesale Banking delivered improved results with trading revenues up. Our corporate lending book remains well-positioned with a focus on investment-grade clients.\n\nOur CET1 ratio increased to 12.6% this quarter. This provides flexibility for growth once we complete our remediation work.\n\nCredit quality remained stable with PCL of 52 bps. We're maintaining prudent reserves given economic uncertainty.\n\nLooking ahead, our priority remains executing on our strategic initiatives and strengthening our US franchise.\n\nI'll now turn the call over to Kelvin Tran, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Lemar Persaud with Cormark Securities.\n\nLemar Persaud: Good morning. Bharat Masrani, can you provide an update on the timeline for completing the AML remediation?\n\nBharat Masrani: We're making substantial progress. We've added over 1,500 people focused on compliance and are upgrading systems. This is a multi-year journey and we're committed to getting it right.\n\nLemar Persaud: And how should we think about growth in US Retail once remediation is complete?\n\nBharat Masrani: We remain committed to the US market. Once we're through this period, we'll look at opportunities to grow. Near-term focus is on execution.\n\nOperator: Our next question comes from Scott Chan with Canaccord Genuity.\n\nScott Chan: Good morning. Can you talk about net interest margin outlook given potential rate cuts?\n\nKelvin Tran: We're well positioned for various rate scenarios. We've been extending duration on the securities portfolio. We expect NIM to remain relatively stable.\n\nScott Chan: And on expenses - what's driving the increase?\n\nKelvin Tran: Expense growth reflects our investments in risk and control infrastructure. We expect growth to moderate as we achieve efficiencies.\n\nOperator: Our next question comes from Doug Young with Desjardins.\n\nDoug Young: Can you discuss the outlook for the Schwab stake?\n\nBharat Masrani: We plan to manage our position over time in an orderly manner. The timing will depend on market conditions.\n\nOperator: That concludes our Q&A session. Thank you for participating."
    }
  },
  {
    "bank_id": "BMO",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q2",
    "call_date": "2024-05-23",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Darryl White, CEO of BMO Financial Group.\n\nWe delivered second quarter with adjusted net income of $2.0B and EPS of $2.74. These results demonstrate the earnings power of our diversified North American franchise.\n\nWe continue to make progress on the Bank of the West integration with synergies tracking ahead of plan.\n\nCanadian Personal and Commercial Banking delivered revenue growth of 5% with solid loan growth. Our market share in business banking remained strong.\n\nUS Personal and Commercial Banking saw continued momentum with revenue growth of 12%. Client retention has exceeded expectations and we're winning new relationships.\n\nBMO Capital Markets had an excellent quarter with revenue up 20%. Our North American platform is winning share with corporate clients and we're building our presence in sustainable finance.\n\nBMO Wealth Management grew earnings by 12% with assets under management reaching record levels. Our private banking business continues to attract high-net-worth clients in both Canada and the US.\n\nCredit quality remained stable with PCL of 52 bps. We're maintaining strong allowances and our diversified portfolio limits concentration risk.\n\nOur CET1 ratio of 13.4% is at the top of our target range, providing flexibility for organic growth. Operating leverage was 5.1% this quarter.\n\nLooking ahead, we're focused on realizing the full potential of our North American franchise.\n\nI'll now turn it over to Tayfun Tuzun, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Darko Mihelic with RBC Capital Markets.\n\nDarko Mihelic: Good morning. Darryl White, now that integration is progressing, how should we think about growth opportunities in the US?\n\nDarryl White: We're excited about our US positioning. The focus near-term is on driving revenue synergies - cross-selling and bringing our full product suite to customers.\n\nDarko Mihelic: And can you quantify the revenue synergy opportunity?\n\nDarryl White: We're making good progress on our synergy targets. Mortgage referrals and treasury management cross-sell are up significantly.\n\nOperator: Our next question comes from Ebrahim Poonawala with Bank of America.\n\nEbrahim Poonawala: Good morning. Can you talk about the commercial real estate portfolio?\n\nPiyush Agrawal: Our CRE portfolio is well-diversified. Office represents less than 10% and is primarily in Canada with strong tenants. We're comfortable with our reserves.\n\nEbrahim Poonawala: And on capital, with CET1 strong, is there room for additional buybacks?\n\nTayfun Tuzun: We have capacity for buybacks and evaluate it regularly. We want to maintain flexibility while also returning capital to shareholders.\n\nOperator: Our next question comes from Lemar Persaud with Cormark Securities.\n\nLemar Persaud: Darryl White, how are you thinking about the competitive environment in California?\n\nDarryl White: California is a dynamic market with strong demographics. We have advantages - our commercial expertise and now meaningful scale. Client feedback has been positive.\n\nOperator: That concludes our Q&A session. Thank you for joining us today."
    }
  },
  {
    "bank_id": "BNS",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q2",
    "call_date": "2024-05-23",
    "sections": {
      "management_discussion": "Good morning and thank you for joining us. I'm Scott Thomson, President and CEO of Scotiabank.\n\nWe reported second quarter net income of $1.9B with diluted EPS of $1.43. While these results reflect ongoing headwinds in some international markets, we're making progress on our strategic repositioning.\n\nWe continue to execute on our strategy of focusing resources on our core markets of Canada, Mexico, and select international operations.\n\nCanadian Banking delivered solid results with revenue growth of 3%. We continue to invest in digital capabilities.\n\nInternational Banking showed resilience despite challenging conditions. Mexico remains our priority international market with significant opportunity.\n\nGlobal Wealth Management had a good quarter with AUM growth. Our Canadian wealth business is gaining share and our digital investing platforms are seeing strong engagement.\n\nGlobal Banking and Markets delivered improved results. Our focus on deepening client relationships is paying off.\n\nCredit quality normalized with PCL of 55 bps. Latin American provisions remain elevated but in line with expectations.\n\nOur CET1 ratio of 12.8% provides adequate flexibility.\n\nI'm confident we're building a more focused and profitable bank.\n\nI'll now turn it over to Raj Viswanathan, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning Scott Thomson. Can you provide more details on the timeline for exiting certain Latin American markets?\n\nScott Thomson: We're making good progress on announced transactions. We expect to close the majority by mid-year with some extending into the second half.\n\nPaul Holden: And how should we think about reinvesting that capital?\n\nScott Thomson: Our priority is strengthening the balance sheet and investing in core markets. Canada and Mexico offer attractive opportunities.\n\nOperator: Our next question comes from Meny Grauman with Scotiabank.\n\nMeny Grauman: Good morning. Can you discuss credit trends in your Canadian retail portfolio?\n\nPhil Thomas: Canadian retail credit remains in good shape. Delinquencies have normalized but are within historical ranges.\n\nMeny Grauman: And on Mexico credit outlook?\n\nPhil Thomas: Mexico PCLs are running higher than Canada but in line with expectations. Our through-the-cycle provisioning means we're comfortable with reserves.\n\nOperator: Our next question comes from Gabriel Dechaine with National Bank Financial.\n\nGabriel Dechaine: Scott Thomson, your efficiency ratio remains above peers - what's the path to closing that gap?\n\nScott Thomson: Improving efficiency is a key priority. The international rationalization will help. We're also investing in automation and digitization.\n\nOperator: That concludes our Q&A session. Thank you for participating."
    }
  },
  {
    "bank_id": "CM",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q2",
    "call_date": "2024-05-23",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Victor Dodig, President and CEO of CIBC.\n\nWe delivered second quarter results with net income of $1.7B and diluted EPS of $1.80. Our focused strategy on being a relationship-oriented bank continues to drive growth.\n\nCIBC's Canadian focus remains a source of strength.\n\nCanadian Personal and Business Banking grew revenue by 4% with balanced growth across products. Our mortgage portfolio grew 3%, maintaining our strong market position.\n\nCanadian Commercial Banking and Wealth Management had an excellent quarter. Commercial loan growth of 6% reflected strong demand from mid-market clients.\n\nUS Commercial Banking and Wealth Management delivered stable results. Our focused US franchise serving clients with Canadian connections continues to perform well.\n\nCapital Markets performed well with revenue up 15%. Our client-focused approach continues to differentiate us in Canadian capital markets.\n\nCredit quality was solid with PCL of 33 bps. Our conservative underwriting approach has resulted in a high-quality loan portfolio.\n\nOur CET1 ratio of 12.9% is among the highest in our peer group, providing substantial flexibility. We continue to invest in technology and our digital capabilities.\n\nLooking ahead, we're confident in our strategy and well positioned for continued success.\n\nI'll now turn it over to Hratch Panossian, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Gabriel Dechaine with National Bank Financial.\n\nGabriel Dechaine: Good morning Victor Dodig. Your mortgage book continues to outperform - what's driving that?\n\nVictor Dodig: A few factors. Conservative underwriting, concentration in urban markets with stronger fundamentals, and our portfolio mix skews toward lower LTV borrowers.\n\nGabriel Dechaine: And on market share in a potentially busier refinancing market?\n\nVictor Dodig: We're well positioned for increased activity. Our branch network and mobile origination tools are excellent.\n\nOperator: Our next question comes from John Aiken with Barclays.\n\nJohn Aiken: Good morning. Can you discuss the outlook for capital markets?\n\nVictor Dodig: Our capital markets business is designed to be less volatile given our client focus. We're gaining share in advisory and our trading desk has invested in capabilities.\n\nJohn Aiken: And on expenses, how should we think about the trajectory?\n\nHratch Panossian: We're committed to positive operating leverage. We continue to invest in technology while achieving efficiencies in other areas.\n\nOperator: Our next question comes from Doug Young with Desjardins.\n\nDoug Young: Victor Dodig, do you see any M&A opportunities that make sense for CIBC?\n\nVictor Dodig: We're very focused on organic growth. We don't feel we need M&A to compete effectively. We'd look at opportunities that strengthen our Canadian franchise.\n\nOperator: That concludes our Q&A session. Thank you for joining us today."
    }
  },
  {
    "bank_id": "NA",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q2",
    "call_date": "2024-05-23",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Laurent Ferreira, President and CEO of National Bank of Canada.\n\nWe delivered second quarter with net income of $915M, up 3% from last year, and diluted EPS of $2.59. These results continue our track record of outperformance.\n\nNational Bank has consistently delivered superior returns among Canadian banks. Our ROE of 17.1% this quarter remains industry-leading.\n\nPersonal and Commercial Banking in Quebec delivered excellent results with revenue growth of 6%. Our market position in Quebec remains exceptionally strong.\n\nWealth Management had an outstanding quarter with earnings up 18%. Our full-service brokerage platform continues to attract advisors and clients.\n\nFinancial Markets delivered strong results with revenue up 20%. Our trading and fixed income businesses performed well.\n\nUS Specialty Finance and International continues to grow profitably.\n\nOur expansion outside Quebec remains a strategic priority. We're building our commercial banking presence in key markets.\n\nCredit quality was excellent with PCL of 21 bps. Our conservative Quebec-focused portfolio continues to deliver below-peer credit costs.\n\nOur CET1 ratio of 13.4% provides substantial flexibility.\n\nI'm proud of what our team continues to achieve. Our focused strategy positions us well for continued outperformance.\n\nI'll now turn it over to Marie Chantal Gingras, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Sohrab Movahedi with BMO Capital Markets.\n\nSohrab Movahedi: Good morning Laurent Ferreira. Can you provide an update on the Canadian Western Bank acquisition?\n\nLaurent Ferreira: We're excited about this transaction. Regulatory approvals are progressing. CWB adds scale in Western Canada and diversifies our geographic exposure.\n\nSohrab Movahedi: What are the synergy expectations?\n\nLaurent Ferreira: We've identified meaningful cost synergies primarily in corporate functions and technology. Revenue synergies from product cross-sell are also mapped out.\n\nOperator: Our next question comes from Doug Young with Desjardins.\n\nDoug Young: Good morning. Your ROE continues to lead the industry - what's sustainable going forward?\n\nLaurent Ferreira: Our ROE reflects our leading Quebec position, efficient operations, and disciplined capital allocation. We see no reason that should change.\n\nDoug Young: And on your geographic expansion, how do you compete outside Quebec?\n\nLaurent Ferreira: We're selective. We focus on commercial banking where relationships matter. We've had success winning clients who appreciate our service model.\n\nOperator: Our next question comes from Darko Mihelic with RBC Capital Markets.\n\nDarko Mihelic: Laurent Ferreira, can you discuss the competitive environment in Quebec?\n\nLaurent Ferreira: Quebec remains our fortress. We have relationships going back generations. Competitors have tried to gain share with limited success.\n\nOperator: That concludes our Q&A session. Thank you for participating in today's call."
    }
  },
  {
    "bank_id": "RY",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q3",
    "call_date": "2024-08-28",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Dave McKay, President and CEO of Royal Bank of Canada. We're pleased to report third quarter results that demonstrate the strength of our diversified business model.\n\nNet income for the quarter was $4.4B, up 7% from last year, with diluted EPS of $3.07. We're building momentum across our businesses.\n\nOur Canadian Banking segment delivered solid results with revenue growth of 6% with We continue to see good demand for mortgages and our digital adoption rates exceeded 85%.. We continue to see solid demand across our product lines and our digital adoption rates continue to climb.\n\nWealth Management had a good quarter with steady growth with assets under administration reaching $1365B. Our high-net-worth business continues to gain share as clients value our comprehensive advisory capabilities and global platform.\n\nCapital Markets performed well despite market volatility. Our global markets franchise benefited from increased client activity and favorable market conditions and we continue to build our sustainable finance capabilities.\n\nCredit quality remains strong with PCL ratio of 25 bps. We continue to maintain robust allowances and our diversified portfolio limits concentration risk.\n\nOur CET1 ratio of 12.9% provides substantial flexibility for growth and capital return. We're well positioned for growth and capital return.\n\nLooking ahead, we're confident in our trajectory and well positioned to navigate the evolving economic environment.\n\nI'll now turn it over to Katherine Gibson, our CFO, to provide more details on our financial performance.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Darko Mihelic with RBC Capital Markets.\n\nDarko Mihelic: Good morning. Dave McKay, can you talk about the outlook for Canadian mortgage growth given the rate environment?\n\nDave McKay: We're seeing steady demand in the mortgage market. As rates potentially decline, we expect to see some pickup in activity. Our focus remains on quality originations.\n\nDarko Mihelic: And on credit in the consumer portfolio?\n\nGraeme Hepworth: Overall credit performance remains solid. Delinquencies remain well within historical ranges.\n\nOperator: Our next question comes from Mario Mendonca with TD Securities.\n\nMario Mendonca: Good morning. Can you discuss the sustainability of the capital markets performance?\n\nDave McKay: While we benefited from favorable conditions, our capital markets franchise has been consistently gaining share. We've invested in talent and technology.\n\nMario Mendonca: And on expenses, how should we think about the efficiency ratio?\n\nKatherine Gibson: We delivered positive operating leverage this quarter. Our technology investments are driving automation savings.\n\nOperator: Our next question comes from Doug Young with Desjardins.\n\nDoug Young: On wealth management, can you talk about the competitive environment?\n\nDave McKay: Talent is always competitive. We've been successful in recruiting through our industry-leading platform and training programs.\n\nOperator: That concludes our Q&A session. Thank you for participating in today's call."
    }
  },
  {
    "bank_id": "TD",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q3",
    "call_date": "2024-08-28",
    "sections": {
      "management_discussion": "Good morning and thank you for joining us. I'm Bharat Masrani, Group President and CEO of TD Bank Group.\n\nWe reported third quarter earnings of $3.3B on an adjusted basis, demonstrating the resilience of our franchise.. Diluted EPS was $1.83 on an adjusted basis.\n\nWe continue to make progress strengthening our risk and control environment in our US operations. We've enhanced our AML compliance program and added experienced leadership.\n\nOur Canadian Personal and Commercial Bank delivered solid results with revenue growth of 4%. We continue to benefit from our leading deposit franchise, with market share above 22%. Net interest margin was stable as the benefits of higher rates offset competitive pressures.\n\nIn US Retail, we saw revenue growth of 2% on a constant currency basis. Our deposit franchise remained strong with market share stable.\n\nWealth Management and Insurance had a good quarter with AUM reaching $520 billion. Our direct investing platform continues to gain clients and we're seeing strong engagement with our digital tools.\n\nWholesale Banking delivered improved results with trading revenues up. Our corporate lending book remains well-positioned with a focus on investment-grade clients.\n\nOur CET1 ratio increased to 13.2% this quarter. This provides flexibility for growth once we complete our remediation work.\n\nCredit quality remained stable with PCL of 54 bps. We're maintaining prudent reserves given economic uncertainty.\n\nLooking ahead, our priority remains executing on our strategic initiatives and strengthening our US franchise.\n\nI'll now turn the call over to Kelvin Tran, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from John Aiken with Barclays.\n\nJohn Aiken: Good morning. Bharat Masrani, can you provide an update on the timeline for completing the AML remediation?\n\nBharat Masrani: We're making substantial progress. We've added over 1,500 people focused on compliance and are upgrading systems. This is a multi-year journey and we're committed to getting it right.\n\nJohn Aiken: And how should we think about growth in US Retail once remediation is complete?\n\nBharat Masrani: We remain committed to the US market. Once we're through this period, we'll look at opportunities to grow. Near-term focus is on execution.\n\nOperator: Our next question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning. Can you talk about net interest margin outlook given potential rate cuts?\n\nKelvin Tran: We're well positioned for various rate scenarios. We've been extending duration on the securities portfolio. We expect NIM to remain relatively stable.\n\nPaul Holden: And on expenses - what's driving the increase?\n\nKelvin Tran: Expense growth reflects our investments in risk and control infrastructure. We expect growth to moderate as we achieve efficiencies.\n\nOperator: Our next question comes from Doug Young with Desjardins.\n\nDoug Young: Can you discuss the outlook for the Schwab stake?\n\nBharat Masrani: We plan to manage our position over time in an orderly manner. The timing will depend on market conditions.\n\nOperator: That concludes our Q&A session. Thank you for participating."
    }
  },
  {
    "bank_id": "BMO",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q3",
    "call_date": "2024-08-28",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Darryl White, CEO of BMO Financial Group.\n\nWe delivered third quarter with adjusted net income of $2.1B and EPS of $2.76. These results demonstrate the earnings power of our diversified North American franchise.\n\nWe continue to make progress on the Bank of the West integration with synergies tracking ahead of plan.\n\nCanadian Personal and Commercial Banking delivered revenue growth of 5% with solid loan growth. Our market share in business banking remained strong.\n\nUS Personal and Commercial Banking saw continued momentum with revenue growth of 12%. Client retention has exceeded expectations and we're winning new relationships.\n\nBMO Capital Markets had an excellent quarter with revenue up 20%. Our North American platform is winning share with corporate clients and we're building our presence in sustainable finance.\n\nBMO Wealth Management grew earnings by 12% with assets under management reaching record levels. Our private banking business continues to attract high-net-worth clients in both Canada and the US.\n\nCredit quality remained stable with PCL of 54 bps. We're maintaining strong allowances and our diversified portfolio limits concentration risk.\n\nOur CET1 ratio of 13.6% is at the top of our target range, providing flexibility for organic growth. Operating leverage was 5.0% this quarter.\n\nLooking ahead, we're focused on realizing the full potential of our North American franchise.\n\nI'll now turn it over to Tayfun Tuzun, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Doug Young with Desjardins.\n\nDoug Young: Good morning. Darryl White, now that integration is progressing, how should we think about growth opportunities in the US?\n\nDarryl White: We're excited about our US positioning. The focus near-term is on driving revenue synergies - cross-selling and bringing our full product suite to customers.\n\nDoug Young: And can you quantify the revenue synergy opportunity?\n\nDarryl White: We're making good progress on our synergy targets. Mortgage referrals and treasury management cross-sell are up significantly.\n\nOperator: Our next question comes from Lemar Persaud with Cormark Securities.\n\nLemar Persaud: Good morning. Can you talk about the commercial real estate portfolio?\n\nPiyush Agrawal: Our CRE portfolio is well-diversified. Office represents less than 10% and is primarily in Canada with strong tenants. We're comfortable with our reserves.\n\nLemar Persaud: And on capital, with CET1 strong, is there room for additional buybacks?\n\nTayfun Tuzun: We have capacity for buybacks and evaluate it regularly. We want to maintain flexibility while also returning capital to shareholders.\n\nOperator: Our next question comes from Darko Mihelic with RBC Capital Markets.\n\nDarko Mihelic: Darryl White, how are you thinking about the competitive environment in California?\n\nDarryl White: California is a dynamic market with strong demographics. We have advantages - our commercial expertise and now meaningful scale. Client feedback has been positive.\n\nOperator: That concludes our Q&A session. Thank you for joining us today."
    }
  },
  {
    "bank_id": "BNS",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q3",
    "call_date": "2024-08-28",
    "sections": {
      "management_discussion": "Good morning and thank you for joining us. I'm Scott Thomson, President and CEO of Scotiabank.\n\nWe reported third quarter net income of $1.9B with diluted EPS of $1.42. While these results reflect ongoing headwinds in some international markets, we're making progress on our strategic repositioning.\n\nWe continue to execute on our strategy of focusing resources on our core markets of Canada, Mexico, and select international operations.\n\nCanadian Banking delivered solid results with revenue growth of 3%. We continue to invest in digital capabilities.\n\nInternational Banking showed resilience despite challenging conditions. Mexico remains our priority international market with significant opportunity.\n\nGlobal Wealth Management had a good quarter with AUM growth. Our Canadian wealth business is gaining share and our digital investing platforms are seeing strong engagement.\n\nGlobal Banking and Markets delivered improved results. Our focus on deepening client relationships is paying off.\n\nCredit quality normalized with PCL of 53 bps. Latin American provisions remain elevated but in line with expectations.\n\nOur CET1 ratio of 12.7% provides adequate flexibility.\n\nI'm confident we're building a more focused and profitable bank.\n\nI'll now turn it over to Raj Viswanathan, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning Scott Thomson. Can you provide more details on the timeline for exiting certain Latin American markets?\n\nScott Thomson: We're making good progress on announced transactions. We expect to close the majority by mid-year with some extending into the second half.\n\nPaul Holden: And how should we think about reinvesting that capital?\n\nScott Thomson: Our priority is strengthening the balance sheet and investing in core markets. Canada and Mexico offer attractive opportunities.\n\nOperator: Our next question comes from Nigel D'Souza with Veritas Investment Research.\n\nNigel D'Souza: Good morning. Can you discuss credit trends in your Canadian retail portfolio?\n\nPhil Thomas: Canadian retail credit remains in good shape. Delinquencies have normalized but are within historical ranges.\n\nNigel D'Souza: And on Mexico credit outlook?\n\nPhil Thomas: Mexico PCLs are running higher than Canada but in line with expectations. Our through-the-cycle provisioning means we're comfortable with reserves.\n\nOperator: Our next question comes from Lemar Persaud with Cormark Securities.\n\nLemar Persaud: Scott Thomson, your efficiency ratio remains above peers - what's the path to closing that gap?\n\nScott Thomson: Improving efficiency is a key priority. The international rationalization will help. We're also investing in automation and digitization.\n\nOperator: That concludes our Q&A session. Thank you for participating."
    }
  },
  {
    "bank_id": "CM",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q3",
    "call_date": "2024-08-28",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Victor Dodig, President and CEO of CIBC.\n\nWe delivered third quarter results with net income of $1.7B and diluted EPS of $1.77. Our focused strategy on being a relationship-oriented bank continues to drive growth.\n\nCIBC's Canadian focus remains a source of strength.\n\nCanadian Personal and Business Banking grew revenue by 4% with balanced growth across products. Our mortgage portfolio grew 3%, maintaining our strong market position.\n\nCanadian Commercial Banking and Wealth Management had an excellent quarter. Commercial loan growth of 6% reflected strong demand from mid-market clients.\n\nUS Commercial Banking and Wealth Management delivered stable results. Our focused US franchise serving clients with Canadian connections continues to perform well.\n\nCapital Markets performed well with revenue up 15%. Our client-focused approach continues to differentiate us in Canadian capital markets.\n\nCredit quality was solid with PCL of 32 bps. Our conservative underwriting approach has resulted in a high-quality loan portfolio.\n\nOur CET1 ratio of 13.6% is among the highest in our peer group, providing substantial flexibility. We continue to invest in technology and our digital capabilities.\n\nLooking ahead, we're confident in our strategy and well positioned for continued success.\n\nI'll now turn it over to Hratch Panossian, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Ebrahim Poonawala with Bank of America.\n\nEbrahim Poonawala: Good morning Victor Dodig. Your mortgage book continues to outperform - what's driving that?\n\nVictor Dodig: A few factors. Conservative underwriting, concentration in urban markets with stronger fundamentals, and our portfolio mix skews toward lower LTV borrowers.\n\nEbrahim Poonawala: And on market share in a potentially busier refinancing market?\n\nVictor Dodig: We're well positioned for increased activity. Our branch network and mobile origination tools are excellent.\n\nOperator: Our next question comes from John Aiken with Barclays.\n\nJohn Aiken: Good morning. Can you discuss the outlook for capital markets?\n\nVictor Dodig: Our capital markets business is designed to be less volatile given our client focus. We're gaining share in advisory and our trading desk has invested in capabilities.\n\nJohn Aiken: And on expenses, how should we think about the trajectory?\n\nHratch Panossian: We're committed to positive operating leverage. We continue to invest in technology while achieving efficiencies in other areas.\n\nOperator: Our next question comes from Gabriel Dechaine with National Bank Financial.\n\nGabriel Dechaine: Victor Dodig, do you see any M&A opportunities that make sense for CIBC?\n\nVictor Dodig: We're very focused on organic growth. We don't feel we need M&A to compete effectively. We'd look at opportunities that strengthen our Canadian franchise.\n\nOperator: That concludes our Q&A session. Thank you for joining us today."
    }
  },
  {
    "bank_id": "NA",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q3",
    "call_date": "2024-08-28",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Laurent Ferreira, President and CEO of National Bank of Canada.\n\nWe delivered third quarter with net income of $891M, up 7% from last year, and diluted EPS of $2.49. These results continue our track record of outperformance.\n\nNational Bank has consistently delivered superior returns among Canadian banks. Our ROE of 18.0% this quarter remains industry-leading.\n\nPersonal and Commercial Banking in Quebec delivered excellent results with revenue growth of 6%. Our market position in Quebec remains exceptionally strong.\n\nWealth Management had an outstanding quarter with earnings up 18%. Our full-service brokerage platform continues to attract advisors and clients.\n\nFinancial Markets delivered strong results with revenue up 20%. Our trading and fixed income businesses performed well.\n\nUS Specialty Finance and International continues to grow profitably.\n\nOur expansion outside Quebec remains a strategic priority. We're building our commercial banking presence in key markets.\n\nCredit quality was excellent with PCL of 21 bps. Our conservative Quebec-focused portfolio continues to deliver below-peer credit costs.\n\nOur CET1 ratio of 13.2% provides substantial flexibility.\n\nI'm proud of what our team continues to achieve. Our focused strategy positions us well for continued outperformance.\n\nI'll now turn it over to Marie Chantal Gingras, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning Laurent Ferreira. Can you provide an update on the Canadian Western Bank acquisition?\n\nLaurent Ferreira: We're excited about this transaction. Regulatory approvals are progressing. CWB adds scale in Western Canada and diversifies our geographic exposure.\n\nPaul Holden: What are the synergy expectations?\n\nLaurent Ferreira: We've identified meaningful cost synergies primarily in corporate functions and technology. Revenue synergies from product cross-sell are also mapped out.\n\nOperator: Our next question comes from Mario Mendonca with TD Securities.\n\nMario Mendonca: Good morning. Your ROE continues to lead the industry - what's sustainable going forward?\n\nLaurent Ferreira: Our ROE reflects our leading Quebec position, efficient operations, and disciplined capital allocation. We see no reason that should change.\n\nMario Mendonca: And on your geographic expansion, how do you compete outside Quebec?\n\nLaurent Ferreira: We're selective. We focus on commercial banking where relationships matter. We've had success winning clients who appreciate our service model.\n\nOperator: Our next question comes from Doug Young with Desjardins.\n\nDoug Young: Laurent Ferreira, can you discuss the competitive environment in Quebec?\n\nLaurent Ferreira: Quebec remains our fortress. We have relationships going back generations. Competitors have tried to gain share with limited success.\n\nOperator: That concludes our Q&A session. Thank you for participating in today's call."
    }
  },
  {
    "bank_id": "RY",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q4",
    "call_date": "2024-12-04",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Dave McKay, President and CEO of Royal Bank of Canada. We're pleased to report fourth quarter and full year results that demonstrate the strength of our diversified business model.\n\nNet income for the quarter was $4.5B, up 5% from last year, with diluted EPS of $3.27. This reflects the strength of our diversified business model.\n\nOur Canadian Banking segment delivered strong results with revenue growth of 8% with We continue to see good demand for mortgages and our digital adoption rates exceeded 85%.. We continue to see solid demand across our product lines and our digital adoption rates continue to climb.\n\nWealth Management had an excellent quarter with earnings up 15% with assets under administration reaching $1421B. Our high-net-worth business continues to gain share as clients value our comprehensive advisory capabilities and global platform.\n\nCapital Markets delivered exceptional results with revenues up 25%. Our global markets franchise benefited from increased client activity and favorable market conditions and we continue to build our sustainable finance capabilities.\n\nCredit quality remains strong with PCL ratio of 27 bps. We continue to maintain robust allowances and our diversified portfolio limits concentration risk.\n\nOur CET1 ratio of 13.7% provides substantial flexibility for growth and capital return. We're well positioned for growth and capital return.\n\nLooking ahead, we're confident in our trajectory and well positioned to navigate the evolving economic environment.\n\nI'll now turn it over to Katherine Gibson, our CFO, to provide more details on our financial performance.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from John Aiken with Barclays.\n\nJohn Aiken: Good morning. Dave McKay, can you talk about the outlook for Canadian mortgage growth given the rate environment?\n\nDave McKay: We're seeing steady demand in the mortgage market. As rates potentially decline, we expect to see some pickup in activity. Our focus remains on quality originations.\n\nJohn Aiken: And on credit in the consumer portfolio?\n\nGraeme Hepworth: Overall credit performance remains solid. Delinquencies remain well within historical ranges.\n\nOperator: Our next question comes from Mario Mendonca with TD Securities.\n\nMario Mendonca: Good morning. Can you discuss the sustainability of the capital markets performance?\n\nDave McKay: While we benefited from favorable conditions, our capital markets franchise has been consistently gaining share. We've invested in talent and technology.\n\nMario Mendonca: And on expenses, how should we think about the efficiency ratio?\n\nKatherine Gibson: We delivered positive operating leverage this quarter. Our technology investments are driving automation savings.\n\nOperator: Our next question comes from Paul Holden with CIBC.\n\nPaul Holden: On wealth management, can you talk about the competitive environment?\n\nDave McKay: Talent is always competitive. We've been successful in recruiting through our industry-leading platform and training programs.\n\nOperator: That concludes our Q&A session. Thank you for participating in today's call."
    }
  },
  {
    "bank_id": "TD",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q4",
    "call_date": "2024-12-04",
    "sections": {
      "management_discussion": "Good morning and thank you for joining us. I'm Bharat Masrani, Group President and CEO of TD Bank Group.\n\nWe reported fourth quarter and full year earnings of $3.4B on an adjusted basis, demonstrating the resilience of our franchise.. Diluted EPS was $1.99 on an adjusted basis.\n\nWe continue to make progress strengthening our risk and control environment in our US operations. We've enhanced our AML compliance program and added experienced leadership.\n\nOur Canadian Personal and Commercial Bank delivered solid results with revenue growth of 4%. We continue to benefit from our leading deposit franchise, with market share above 22%. Net interest margin was stable as the benefits of higher rates offset competitive pressures.\n\nIn US Retail, showed improving trends with revenue growth of 4%. Our deposit franchise remained strong with market share stable.\n\nWealth Management and Insurance had a good quarter with AUM reaching $520 billion. Our direct investing platform continues to gain clients and we're seeing strong engagement with our digital tools.\n\nWholesale Banking delivered improved results with trading revenues up. Our corporate lending book remains well-positioned with a focus on investment-grade clients.\n\nOur CET1 ratio increased to 13.9% this quarter. This provides flexibility for growth once we complete our remediation work.\n\nCredit quality reflected normalization with PCL of 56 bps. We're maintaining prudent reserves given economic uncertainty.\n\nLooking ahead, our priority remains executing on our strategic initiatives and strengthening our US franchise.\n\nI'll now turn the call over to Kelvin Tran, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from John Aiken with Barclays.\n\nJohn Aiken: Good morning. Bharat Masrani, can you provide an update on the timeline for completing the AML remediation?\n\nBharat Masrani: We're making substantial progress. We've added over 1,500 people focused on compliance and are upgrading systems. This is a multi-year journey and we're committed to getting it right.\n\nJohn Aiken: And how should we think about growth in US Retail once remediation is complete?\n\nBharat Masrani: We remain committed to the US market. Once we're through this period, we'll look at opportunities to grow. Near-term focus is on execution.\n\nOperator: Our next question comes from Gabriel Dechaine with National Bank Financial.\n\nGabriel Dechaine: Good morning. Can you talk about net interest margin outlook given potential rate cuts?\n\nKelvin Tran: We're well positioned for various rate scenarios. We've been extending duration on the securities portfolio. We expect NIM to remain relatively stable.\n\nGabriel Dechaine: And on expenses - what's driving the increase?\n\nKelvin Tran: Expense growth reflects our investments in risk and control infrastructure. We expect growth to moderate as we achieve efficiencies.\n\nOperator: Our next question comes from Ebrahim Poonawala with Bank of America.\n\nEbrahim Poonawala: Can you discuss the outlook for the Schwab stake?\n\nBharat Masrani: We plan to manage our position over time in an orderly manner. The timing will depend on market conditions.\n\nOperator: That concludes our Q&A session. Thank you for participating."
    }
  },
  {
    "bank_id": "BMO",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q4",
    "call_date": "2024-12-04",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Darryl White, CEO of BMO Financial Group.\n\nWe delivered fourth quarter and full year with adjusted net income of $2.1B and EPS of $2.84. These results demonstrate the earnings power of our diversified North American franchise.\n\nWe continue to make progress on the Bank of the West integration with synergies tracking ahead of plan.\n\nCanadian Personal and Commercial Banking delivered revenue growth of 5% with solid loan growth. Our market share in business banking remained strong.\n\nUS Personal and Commercial Banking saw continued momentum with revenue growth of 12%. Client retention has exceeded expectations and we're winning new relationships.\n\nBMO Capital Markets had an excellent quarter with revenue up 20%. Our North American platform is winning share with corporate clients and we're building our presence in sustainable finance.\n\nBMO Wealth Management grew earnings by 12% with assets under management reaching record levels. Our private banking business continues to attract high-net-worth clients in both Canada and the US.\n\nCredit quality normalized as expected with PCL of 58 bps. We're maintaining strong allowances and our diversified portfolio limits concentration risk.\n\nOur CET1 ratio of 14.6% is at the top of our target range, providing flexibility for organic growth. Operating leverage was 5.5% this quarter.\n\nLooking ahead, we're focused on realizing the full potential of our North American franchise.\n\nI'll now turn it over to Tayfun Tuzun, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Darko Mihelic with RBC Capital Markets.\n\nDarko Mihelic: Good morning. Darryl White, now that integration is progressing, how should we think about growth opportunities in the US?\n\nDarryl White: We're excited about our US positioning. The focus near-term is on driving revenue synergies - cross-selling and bringing our full product suite to customers.\n\nDarko Mihelic: And can you quantify the revenue synergy opportunity?\n\nDarryl White: We're making good progress on our synergy targets. Mortgage referrals and treasury management cross-sell are up significantly.\n\nOperator: Our next question comes from Gabriel Dechaine with National Bank Financial.\n\nGabriel Dechaine: Good morning. Can you talk about the commercial real estate portfolio?\n\nPiyush Agrawal: Our CRE portfolio is well-diversified. Office represents less than 10% and is primarily in Canada with strong tenants. We're comfortable with our reserves.\n\nGabriel Dechaine: And on capital, with CET1 strong, is there room for additional buybacks?\n\nTayfun Tuzun: We have capacity for buybacks and evaluate it regularly. We want to maintain flexibility while also returning capital to shareholders.\n\nOperator: Our next question comes from Nigel D'Souza with Veritas Investment Research.\n\nNigel D'Souza: Darryl White, how are you thinking about the competitive environment in California?\n\nDarryl White: California is a dynamic market with strong demographics. We have advantages - our commercial expertise and now meaningful scale. Client feedback has been positive.\n\nOperator: That concludes our Q&A session. Thank you for joining us today."
    }
  },
  {
    "bank_id": "BNS",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q4",
    "call_date": "2024-12-04",
    "sections": {
      "management_discussion": "Good morning and thank you for joining us. I'm Scott Thomson, President and CEO of Scotiabank.\n\nWe reported fourth quarter and full year net income of $2.0B with diluted EPS of $1.59. These results show the early benefits of our strategic refocusing.\n\nWe continue to execute on our strategy of focusing resources on our core markets of Canada, Mexico, and select international operations.\n\nCanadian Banking delivered solid results with revenue growth of 3%. We continue to invest in digital capabilities.\n\nInternational Banking showed improvement with Mexico contributing strongly. Mexico remains our priority international market with significant opportunity.\n\nGlobal Wealth Management had a good quarter with AUM growth. Our Canadian wealth business is gaining share and our digital investing platforms are seeing strong engagement.\n\nGlobal Banking and Markets delivered improved results. Our focus on deepening client relationships is paying off.\n\nCredit quality normalized with PCL of 55 bps. Latin American provisions remain elevated but in line with expectations.\n\nOur CET1 ratio of 13.3% provides adequate flexibility.\n\nI'm confident we're building a more focused and profitable bank.\n\nI'll now turn it over to Raj Viswanathan, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Sohrab Movahedi with BMO Capital Markets.\n\nSohrab Movahedi: Good morning Scott Thomson. Can you provide more details on the timeline for exiting certain Latin American markets?\n\nScott Thomson: We're making good progress on announced transactions. We expect to close the majority by mid-year with some extending into the second half.\n\nSohrab Movahedi: And how should we think about reinvesting that capital?\n\nScott Thomson: Our priority is strengthening the balance sheet and investing in core markets. Canada and Mexico offer attractive opportunities.\n\nOperator: Our next question comes from Doug Young with Desjardins.\n\nDoug Young: Good morning. Can you discuss credit trends in your Canadian retail portfolio?\n\nPhil Thomas: Canadian retail credit remains in good shape. Delinquencies have normalized but are within historical ranges.\n\nDoug Young: And on Mexico credit outlook?\n\nPhil Thomas: Mexico PCLs are running higher than Canada but in line with expectations. Our through-the-cycle provisioning means we're comfortable with reserves.\n\nOperator: Our next question comes from Nigel D'Souza with Veritas Investment Research.\n\nNigel D'Souza: Scott Thomson, your efficiency ratio remains above peers - what's the path to closing that gap?\n\nScott Thomson: Improving efficiency is a key priority. The international rationalization will help. We're also investing in automation and digitization.\n\nOperator: That concludes our Q&A session. Thank you for participating."
    }
  },
  {
    "bank_id": "CM",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q4",
    "call_date": "2024-12-04",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Victor Dodig, President and CEO of CIBC.\n\nWe delivered fourth quarter and full year results with net income of $1.8B and diluted EPS of $1.87. Our focused strategy on being a relationship-oriented bank continues to drive growth.\n\nCIBC's Canadian focus remains a source of strength.\n\nCanadian Personal and Business Banking grew revenue by 4% with balanced growth across products. Our mortgage portfolio grew 3%, maintaining our strong market position.\n\nCanadian Commercial Banking and Wealth Management had an excellent quarter. Commercial loan growth of 6% reflected strong demand from mid-market clients.\n\nUS Commercial Banking and Wealth Management delivered stable results. Our focused US franchise serving clients with Canadian connections continues to perform well.\n\nCapital Markets performed well with revenue up 15%. Our client-focused approach continues to differentiate us in Canadian capital markets.\n\nCredit quality was solid with PCL of 35 bps. Our conservative underwriting approach has resulted in a high-quality loan portfolio.\n\nOur CET1 ratio of 14.6% is among the highest in our peer group, providing substantial flexibility. We continue to invest in technology and our digital capabilities.\n\nLooking ahead, we're confident in our strategy and well positioned for continued success.\n\nI'll now turn it over to Hratch Panossian, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Doug Young with Desjardins.\n\nDoug Young: Good morning Victor Dodig. Your mortgage book continues to outperform - what's driving that?\n\nVictor Dodig: A few factors. Conservative underwriting, concentration in urban markets with stronger fundamentals, and our portfolio mix skews toward lower LTV borrowers.\n\nDoug Young: And on market share in a potentially busier refinancing market?\n\nVictor Dodig: We're well positioned for increased activity. Our branch network and mobile origination tools are excellent.\n\nOperator: Our next question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning. Can you discuss the outlook for capital markets?\n\nVictor Dodig: Our capital markets business is designed to be less volatile given our client focus. We're gaining share in advisory and our trading desk has invested in capabilities.\n\nPaul Holden: And on expenses, how should we think about the trajectory?\n\nHratch Panossian: We're committed to positive operating leverage. We continue to invest in technology while achieving efficiencies in other areas.\n\nOperator: Our next question comes from Ebrahim Poonawala with Bank of America.\n\nEbrahim Poonawala: Victor Dodig, do you see any M&A opportunities that make sense for CIBC?\n\nVictor Dodig: We're very focused on organic growth. We don't feel we need M&A to compete effectively. We'd look at opportunities that strengthen our Canadian franchise.\n\nOperator: That concludes our Q&A session. Thank you for joining us today."
    }
  },
  {
    "bank_id": "NA",
    "fiscal_year": 2024,
    "fiscal_quarter": "Q4",
    "call_date": "2024-12-04",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Laurent Ferreira, President and CEO of National Bank of Canada.\n\nWe delivered fourth quarter and full year with net income of $980M, up 6% from last year, and diluted EPS of $2.64. These results continue our track record of outperformance.\n\nNational Bank has consistently delivered superior returns among Canadian banks. Our ROE of 18.2% this quarter remains industry-leading.\n\nPersonal and Commercial Banking in Quebec delivered excellent results with revenue growth of 6%. Our market position in Quebec remains exceptionally strong.\n\nWealth Management had an outstanding quarter with earnings up 18%. Our full-service brokerage platform continues to attract advisors and clients.\n\nFinancial Markets delivered strong results with revenue up 20%. Our trading and fixed income businesses performed well.\n\nUS Specialty Finance and International continues to grow profitably.\n\nOur expansion outside Quebec remains a strategic priority. We're building our commercial banking presence in key markets.\n\nCredit quality was excellent with PCL of 22 bps. Our conservative Quebec-focused portfolio continues to deliver below-peer credit costs.\n\nOur CET1 ratio of 14.6% provides substantial flexibility.\n\nI'm proud of what our team continues to achieve. Our focused strategy positions us well for continued outperformance.\n\nI'll now turn it over to Marie Chantal Gingras, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Darko Mihelic with RBC Capital Markets.\n\nDarko Mihelic: Good morning Laurent Ferreira. Can you provide an update on the Canadian Western Bank acquisition?\n\nLaurent Ferreira: We're excited about this transaction. Regulatory approvals are progressing. CWB adds scale in Western Canada and diversifies our geographic exposure.\n\nDarko Mihelic: What are the synergy expectations?\n\nLaurent Ferreira: We've identified meaningful cost synergies primarily in corporate functions and technology. Revenue synergies from product cross-sell are also mapped out.\n\nOperator: Our next question comes from Sohrab Movahedi with BMO Capital Markets.\n\nSohrab Movahedi: Good morning. Your ROE continues to lead the industry - what's sustainable going forward?\n\nLaurent Ferreira: Our ROE reflects our leading Quebec position, efficient operations, and disciplined capital allocation. We see no reason that should change.\n\nSohrab Movahedi: And on your geographic expansion, how do you compete outside Quebec?\n\nLaurent Ferreira: We're selective. We focus on commercial banking where relationships matter. We've had success winning clients who appreciate our service model.\n\nOperator: Our next question comes from Gabriel Dechaine with National Bank Financial.\n\nGabriel Dechaine: Laurent Ferreira, can you discuss the competitive environment in Quebec?\n\nLaurent Ferreira: Quebec remains our fortress. We have relationships going back generations. Competitors have tried to gain share with limited success.\n\nOperator: That concludes our Q&A session. Thank you for participating in today's call."
    }
  },
  {
    "bank_id": "RY",
    "fiscal_year": 2025,
    "fiscal_quarter": "Q1",
    "call_date": "2025-02-27",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Dave McKay, President and CEO of Royal Bank of Canada. We're pleased to report first quarter results that demonstrate the strength of our diversified business model.\n\nNet income for the quarter was $4.6B, up 7% from last year, with diluted EPS of $3.21. This reflects the strength of our diversified business model.\n\nOur Canadian Banking segment delivered solid results with revenue growth of 6% with We continue to see good demand for mortgages and our digital adoption rates exceeded 85%.. We continue to see solid demand across our product lines and our digital adoption rates continue to climb.\n\nWealth Management had an excellent quarter with earnings up 15% with assets under administration reaching $1482B. Our high-net-worth business continues to gain share as clients value our comprehensive advisory capabilities and global platform.\n\nCapital Markets delivered exceptional results with revenues up 25%. Our global markets franchise benefited from increased client activity and favorable market conditions and we continue to build our sustainable finance capabilities.\n\nCredit quality remains strong with PCL ratio of 27 bps. We continue to maintain robust allowances and our diversified portfolio limits concentration risk.\n\nOur CET1 ratio of 14.4% provides substantial flexibility for growth and capital return. We're well positioned for growth and capital return.\n\nLooking ahead, we're confident in our trajectory and well positioned to navigate the evolving economic environment.\n\nI'll now turn it over to Katherine Gibson, our CFO, to provide more details on our financial performance.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from John Aiken with Barclays.\n\nJohn Aiken: Good morning. Dave McKay, can you talk about the outlook for Canadian mortgage growth given the rate environment?\n\nDave McKay: We're seeing steady demand in the mortgage market. As rates potentially decline, we expect to see some pickup in activity. Our focus remains on quality originations.\n\nJohn Aiken: And on credit in the consumer portfolio?\n\nGraeme Hepworth: Overall credit performance remains solid. Delinquencies remain well within historical ranges.\n\nOperator: Our next question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning. Can you discuss the sustainability of the capital markets performance?\n\nDave McKay: While we benefited from favorable conditions, our capital markets franchise has been consistently gaining share. We've invested in talent and technology.\n\nPaul Holden: And on expenses, how should we think about the efficiency ratio?\n\nKatherine Gibson: We delivered positive operating leverage this quarter. Our technology investments are driving automation savings.\n\nOperator: Our next question comes from Gabriel Dechaine with National Bank Financial.\n\nGabriel Dechaine: On wealth management, can you talk about the competitive environment?\n\nDave McKay: Talent is always competitive. We've been successful in recruiting through our industry-leading platform and training programs.\n\nOperator: That concludes our Q&A session. Thank you for participating in today's call."
    }
  },
  {
    "bank_id": "TD",
    "fiscal_year": 2025,
    "fiscal_quarter": "Q1",
    "call_date": "2025-02-27",
    "sections": {
      "management_discussion": "Good morning and thank you for joining us. I'm Bharat Masrani, Group President and CEO of TD Bank Group.\n\nWe reported first quarter earnings of $3.6B on an adjusted basis, demonstrating the resilience of our franchise.. Diluted EPS was $1.98 on an adjusted basis.\n\nWe've made substantial progress on our US remediation efforts and are seeing the results of our investments.\n\nOur Canadian Personal and Commercial Bank delivered solid results with revenue growth of 4%. We continue to benefit from our leading deposit franchise, with market share above 22%. Net interest margin was stable as the benefits of higher rates offset competitive pressures.\n\nIn US Retail, showed improving trends with revenue growth of 4%. Our deposit franchise remained strong with market share stable.\n\nWealth Management and Insurance had a good quarter with AUM reaching $520 billion. Our direct investing platform continues to gain clients and we're seeing strong engagement with our digital tools.\n\nWholesale Banking delivered improved results with trading revenues up. Our corporate lending book remains well-positioned with a focus on investment-grade clients.\n\nOur CET1 ratio increased to 13.8% this quarter. This provides flexibility for growth once we complete our remediation work.\n\nCredit quality reflected normalization with PCL of 58 bps. We're maintaining prudent reserves given economic uncertainty.\n\nLooking ahead, our priority remains executing on our strategic initiatives and strengthening our US franchise.\n\nI'll now turn the call over to Kelvin Tran, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from John Aiken with Barclays.\n\nJohn Aiken: Good morning. Bharat Masrani, can you provide an update on the timeline for completing the AML remediation?\n\nBharat Masrani: We're making substantial progress. We've added over 1,500 people focused on compliance and are upgrading systems. This is a multi-year journey and we're committed to getting it right.\n\nJohn Aiken: And how should we think about growth in US Retail once remediation is complete?\n\nBharat Masrani: We remain committed to the US market. Once we're through this period, we'll look at opportunities to grow. Near-term focus is on execution.\n\nOperator: Our next question comes from Mario Mendonca with TD Securities.\n\nMario Mendonca: Good morning. Can you talk about net interest margin outlook given potential rate cuts?\n\nKelvin Tran: We're well positioned for various rate scenarios. We've been extending duration on the securities portfolio. We expect NIM to remain relatively stable.\n\nMario Mendonca: And on expenses - what's driving the increase?\n\nKelvin Tran: Expense growth reflects our investments in risk and control infrastructure. We expect growth to moderate as we achieve efficiencies.\n\nOperator: Our next question comes from Doug Young with Desjardins.\n\nDoug Young: Can you discuss the outlook for the Schwab stake?\n\nBharat Masrani: We plan to manage our position over time in an orderly manner. The timing will depend on market conditions.\n\nOperator: That concludes our Q&A session. Thank you for participating."
    }
  },
  {
    "bank_id": "BMO",
    "fiscal_year": 2025,
    "fiscal_quarter": "Q1",
    "call_date": "2025-02-27",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Darryl White, CEO of BMO Financial Group.\n\nWe delivered first quarter with adjusted net income of $2.1B and EPS of $2.90. These results demonstrate the earnings power of our diversified North American franchise.\n\nThe Bank of the West integration is largely complete and we're now operating as one bank across our US footprint.\n\nCanadian Personal and Commercial Banking delivered revenue growth of 5% with solid loan growth. Our market share in business banking remained strong.\n\nUS Personal and Commercial Banking saw continued momentum with revenue growth of 12%. Client retention has exceeded expectations and we're winning new relationships.\n\nBMO Capital Markets had an excellent quarter with revenue up 20%. Our North American platform is winning share with corporate clients and we're building our presence in sustainable finance.\n\nBMO Wealth Management grew earnings by 12% with assets under management reaching record levels. Our private banking business continues to attract high-net-worth clients in both Canada and the US.\n\nCredit quality normalized as expected with PCL of 58 bps. We're maintaining strong allowances and our diversified portfolio limits concentration risk.\n\nOur CET1 ratio of 14.0% is at the top of our target range, providing flexibility for organic growth. Operating leverage was 5.3% this quarter.\n\nLooking ahead, we're focused on realizing the full potential of our North American franchise.\n\nI'll now turn it over to Tayfun Tuzun, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning. Darryl White, now that integration is progressing, how should we think about growth opportunities in the US?\n\nDarryl White: We're excited about our US positioning. The focus near-term is on driving revenue synergies - cross-selling and bringing our full product suite to customers.\n\nPaul Holden: And can you quantify the revenue synergy opportunity?\n\nDarryl White: We're making good progress on our synergy targets. Mortgage referrals and treasury management cross-sell are up significantly.\n\nOperator: Our next question comes from Doug Young with Desjardins.\n\nDoug Young: Good morning. Can you talk about the commercial real estate portfolio?\n\nPiyush Agrawal: Our CRE portfolio is well-diversified. Office represents less than 10% and is primarily in Canada with strong tenants. We're comfortable with our reserves.\n\nDoug Young: And on capital, with CET1 strong, is there room for additional buybacks?\n\nTayfun Tuzun: We have capacity for buybacks and evaluate it regularly. We want to maintain flexibility while also returning capital to shareholders.\n\nOperator: Our next question comes from Mario Mendonca with TD Securities.\n\nMario Mendonca: Darryl White, how are you thinking about the competitive environment in California?\n\nDarryl White: California is a dynamic market with strong demographics. We have advantages - our commercial expertise and now meaningful scale. Client feedback has been positive.\n\nOperator: That concludes our Q&A session. Thank you for joining us today."
    }
  },
  {
    "bank_id": "BNS",
    "fiscal_year": 2025,
    "fiscal_quarter": "Q1",
    "call_date": "2025-02-27",
    "sections": {
      "management_discussion": "Good morning and thank you for joining us. I'm Scott Thomson, President and CEO of Scotiabank.\n\nWe reported first quarter net income of $2.1B with diluted EPS of $1.59. These results show the early benefits of our strategic refocusing.\n\nWe continue to execute on our strategy of focusing resources on our core markets of Canada, Mexico, and select international operations.\n\nCanadian Banking delivered solid results with revenue growth of 3%. We continue to invest in digital capabilities.\n\nInternational Banking showed improvement with Mexico contributing strongly. Mexico remains our priority international market with significant opportunity.\n\nGlobal Wealth Management had a good quarter with AUM growth. Our Canadian wealth business is gaining share and our digital investing platforms are seeing strong engagement.\n\nGlobal Banking and Markets delivered improved results. Our focus on deepening client relationships is paying off.\n\nCredit quality normalized with PCL of 57 bps. Latin American provisions remain elevated but in line with expectations.\n\nOur CET1 ratio of 14.0% provides adequate flexibility.\n\nI'm confident we're building a more focused and profitable bank.\n\nI'll now turn it over to Raj Viswanathan, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Lemar Persaud with Cormark Securities.\n\nLemar Persaud: Good morning Scott Thomson. Can you provide more details on the timeline for exiting certain Latin American markets?\n\nScott Thomson: We're making good progress on announced transactions. We expect to close the majority by mid-year with some extending into the second half.\n\nLemar Persaud: And how should we think about reinvesting that capital?\n\nScott Thomson: Our priority is strengthening the balance sheet and investing in core markets. Canada and Mexico offer attractive opportunities.\n\nOperator: Our next question comes from Nigel D'Souza with Veritas Investment Research.\n\nNigel D'Souza: Good morning. Can you discuss credit trends in your Canadian retail portfolio?\n\nPhil Thomas: Canadian retail credit remains in good shape. Delinquencies have normalized but are within historical ranges.\n\nNigel D'Souza: And on Mexico credit outlook?\n\nPhil Thomas: Mexico PCLs are running higher than Canada but in line with expectations. Our through-the-cycle provisioning means we're comfortable with reserves.\n\nOperator: Our next question comes from Paul Holden with CIBC.\n\nPaul Holden: Scott Thomson, your efficiency ratio remains above peers - what's the path to closing that gap?\n\nScott Thomson: Improving efficiency is a key priority. The international rationalization will help. We're also investing in automation and digitization.\n\nOperator: That concludes our Q&A session. Thank you for participating."
    }
  },
  {
    "bank_id": "CM",
    "fiscal_year": 2025,
    "fiscal_quarter": "Q1",
    "call_date": "2025-02-27",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Victor Dodig, President and CEO of CIBC.\n\nWe delivered first quarter results with net income of $1.9B and diluted EPS of $1.89. Our focused strategy on being a relationship-oriented bank continues to drive growth.\n\nCIBC's Canadian focus remains a source of strength.\n\nCanadian Personal and Business Banking grew revenue by 4% with balanced growth across products. Our mortgage portfolio grew 3%, maintaining our strong market position.\n\nCanadian Commercial Banking and Wealth Management had an excellent quarter. Commercial loan growth of 6% reflected strong demand from mid-market clients.\n\nUS Commercial Banking and Wealth Management delivered stable results. Our focused US franchise serving clients with Canadian connections continues to perform well.\n\nCapital Markets performed well with revenue up 15%. Our client-focused approach continues to differentiate us in Canadian capital markets.\n\nCredit quality was solid with PCL of 34 bps. Our conservative underwriting approach has resulted in a high-quality loan portfolio.\n\nOur CET1 ratio of 14.1% is among the highest in our peer group, providing substantial flexibility. We continue to invest in technology and our digital capabilities.\n\nLooking ahead, we're confident in our strategy and well positioned for continued success.\n\nI'll now turn it over to Hratch Panossian, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Sohrab Movahedi with BMO Capital Markets.\n\nSohrab Movahedi: Good morning Victor Dodig. Your mortgage book continues to outperform - what's driving that?\n\nVictor Dodig: A few factors. Conservative underwriting, concentration in urban markets with stronger fundamentals, and our portfolio mix skews toward lower LTV borrowers.\n\nSohrab Movahedi: And on market share in a potentially busier refinancing market?\n\nVictor Dodig: We're well positioned for increased activity. Our branch network and mobile origination tools are excellent.\n\nOperator: Our next question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning. Can you discuss the outlook for capital markets?\n\nVictor Dodig: Our capital markets business is designed to be less volatile given our client focus. We're gaining share in advisory and our trading desk has invested in capabilities.\n\nPaul Holden: And on expenses, how should we think about the trajectory?\n\nHratch Panossian: We're committed to positive operating leverage. We continue to invest in technology while achieving efficiencies in other areas.\n\nOperator: Our next question comes from Mario Mendonca with TD Securities.\n\nMario Mendonca: Victor Dodig, do you see any M&A opportunities that make sense for CIBC?\n\nVictor Dodig: We're very focused on organic growth. We don't feel we need M&A to compete effectively. We'd look at opportunities that strengthen our Canadian franchise.\n\nOperator: That concludes our Q&A session. Thank you for joining us today."
    }
  },
  {
    "bank_id": "NA",
    "fiscal_year": 2025,
    "fiscal_quarter": "Q1",
    "call_date": "2025-02-27",
    "sections": {
      "management_discussion": "Good morning everyone. I'm Laurent Ferreira, President and CEO of National Bank of Canada.\n\nWe delivered first quarter with net income of $974M, up 2% from last year, and diluted EPS of $2.69. These results continue our track record of outperformance.\n\nNational Bank has consistently delivered superior returns among Canadian banks. Our ROE of 18.9% this quarter remains industry-leading.\n\nPersonal and Commercial Banking in Quebec delivered excellent results with revenue growth of 6%. Our market position in Quebec remains exceptionally strong.\n\nWealth Management had an outstanding quarter with earnings up 18%. Our full-service brokerage platform continues to attract advisors and clients.\n\nFinancial Markets delivered strong results with revenue up 20%. Our trading and fixed income businesses performed well.\n\nUS Specialty Finance and International continues to grow profitably.\n\nOur expansion outside Quebec remains a strategic priority. We're building our commercial banking presence in key markets.\n\nCredit quality was excellent with PCL of 24 bps. Our conservative Quebec-focused portfolio continues to deliver below-peer credit costs.\n\nOur CET1 ratio of 14.7% provides substantial flexibility.\n\nI'm proud of what our team continues to achieve. Our focused strategy positions us well for continued outperformance.\n\nI'll now turn it over to Marie Chantal Gingras, our CFO.",
      "qa": "Operator: We'll now begin the question and answer session. Our first question comes from Lemar Persaud with Cormark Securities.\n\nLemar Persaud: Good morning Laurent Ferreira. Can you provide an update on the Canadian Western Bank acquisition?\n\nLaurent Ferreira: We're excited about this transaction. Regulatory approvals are progressing. CWB adds scale in Western Canada and diversifies our geographic exposure.\n\nLemar Persaud: What are the synergy expectations?\n\nLaurent Ferreira: We've identified meaningful cost synergies primarily in corporate functions and technology. Revenue synergies from product cross-sell are also mapped out.\n\nOperator: Our next question comes from Paul Holden with CIBC.\n\nPaul Holden: Good morning. Your ROE continues to lead the industry - what's sustainable going forward?\n\nLaurent Ferreira: Our ROE reflects our leading Quebec position, efficient operations, and disciplined capital allocation. We see no reason that should change.\n\nPaul Holden: And on your geographic expansion, how do you compete outside Quebec?\n\nLaurent Ferreira: We're selective. We focus on commercial banking where relationships matter. We've had success winning clients who appreciate our service model.\n\nOperator: Our next question comes from Darko Mihelic with RBC Capital Markets.\n\nDarko Mihelic: Laurent Ferreira, can you discuss the competitive environment in Quebec?\n\nLaurent Ferreira: Quebec remains our fortress. We have relationships going back generations. Competitors have tried to gain share with limited success.\n\nOperator: That concludes our Q&A session. Thank you for participating in today's call."
    }
  }
]